In [3]:

import pandas as pd
import numpy as np

pathArchivoCSV='C:/Users/andre/ProcesamientoArchivosPython/ArchivosCSV/Empleados_Backup.csv'

dataFrame=pd.read_csv(pathArchivoCSV, encoding='latin-1', sep=";")

dataFrame=dataFrame.astype({'N° Empleado': 'int','Nombre': 'string', 'Apellido/s':'string', 'Fecha De Nacimiento':'string', 'Pais De Nacimiento':'string', 'Código De Contrato':'float64','Sueldo': 'float64'})

dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   N° Empleado          6 non-null      int32
 1   Nombre               6 non-null      string
 2   Apellido/s           6 non-null      string
 3   Fecha De Nacimiento  6 non-null      string
 4   Pais De Nacimiento   6 non-null      string
 5   Código De Contrato   6 non-null      float64
 6   Sueldo               6 non-null      float64
dtypes: float64(2), int32(1), string(4)
memory usage: 440.0 bytes

In [4]:
'''
El Metodo describe lo implementamos para ver de forma sencilla algunas medidas de nuestros datos.
Los % que se muestren se analizan con variables contables, por eso que se nos generan solo 3 columnas
e este caso.
También es un ejemplo de como podemos seleccionar ciertas columnas por su indice mediante el uso
de la librería numpy.
'''
dataFrame.describe()

       N° Empleado  Código De Contrato     Sueldo
count     6.000000            6.000000   6.000000
mean   5491.500000          978.500000  46.500000
std       1.870829            1.870829   7.556454
min    5489.000000          976.000000  34.000000
25%    5490.250000          977.250000  43.500000
50%    5491.500000          978.500000  47.500000
75%    5492.750000          979.750000  51.500000
max    5494.000000          981.000000  55.000000

In [10]:
'''
Podemos Generar una muestra de 3 Registros pasandole el nombre de la columnna/campo deseado 
dentro de regex, se pueden usar expresiones regulares para tomar equis muestras para equis columnas
en relacion a la expresion('Su*')
'''
dataFrame.filter(regex='Sueldo', axis=1).sample(3)

   Sueldo
0    34.0
2    45.0
5    50.0

In [17]:
'''
Generamos la media de cada campo contable en relacion a un grupo(en este caso hay poca info,
no vamos a tener nada analizable, pero suponte tener varios empleados con  varios sueldos iguales..)
'''
#dataFrame.groupby('condicion de agrupamiento').mean()

'\nGeneramos la media de cada campo contable en relacion a un grupo(en este caso hay poca info,\nno vamos a tener nada analizable, pero suponte tener varios empleados con  varios sueldos iguales..)\n'

In [20]:
'''
Ordenamiento segun los 3 primeros sueldos más altos
'''
dataFrame.sort_values(by='Sueldo',ascending=False)[['N° Empleado','Nombre','Sueldo']].head(3)

   N° Empleado   Nombre  Sueldo
4         5493   Andres    55.0
3         5492  Martina    52.0
5         5494   Romina    50.0

In [21]:
'''
Ordenamiento segun los 3 primeros sueldos más bajos
'''
dataFrame.sort_values(by='Sueldo',ascending=True)[['N° Empleado','Nombre','Sueldo']].head(3)

   N° Empleado   Nombre  Sueldo
0         5489    Juan     34.0
1         5490  Marcela    43.0
2         5491  Alberto    45.0

In [22]:
'''
Y así sucesivamente, estadisticamente hablando hay infinidad de posibles analisis.

Pagina Recomendada:
https://darecode.com/blog/analisis-de-datos-libreria-pandas-python/


'''

'\nY así sucesivamente, estadisticamente hablando hay infinidad de posibles analisis.\n\nPagina Recomendada:\nhttps://darecode.com/blog/analisis-de-datos-libreria-pandas-python/\n\n\n'